name: "postprocessing"
backend: "python"
max_batch_size: ${triton_max_batch_size}

input [
   {
    name: "output_ids"
    data_type: TYPE_INT32
    dims: [ -1, -1 ]
    
  }
]
output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ -1, -1 ]
  }
]
parameters {
  key: "tokenizer_dir"
  value: {
    string_value: "${tokenizer_dir}"
  }
}
instance_group [
  { 
     count: ${postprocessing_instance_count}
     kind: KIND_CPU
  }
]
