name: "ensemble"
platform: "ensemble"
max_batch_size: ${triton_max_batch_size}
input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
      {
        name: "max_new_tokens"
        data_type: TYPE_INT32
        dims: [ -1 ]
    },
      {
        name: "beam_width"
        data_type: TYPE_INT32
        dims: [ 1 ]
        optional: true
      }
]
output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ -1, -1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocessing"
      model_version: -1
      input_map {
        key: "text_input"
        value: "text_input"
      }
      output_map {
        key: "input_ids"
        value: "input_ids"
      }
      output_map {
        key: "attention_mask"
        value: "attention_mask"
      }
    },
    {
      model_name: "tensorrt_llm"
      model_version: -1
      input_map {
        key: "input_ids"
        value: "input_ids"
      }
      input_map {
        key: "attention_mask"
        value: "attention_mask"
      }
      input_map {
          key: "beam_width"
          value: "beam_width"
      }
      input_map {
        key: "max_new_tokens"
        value: "max_new_tokens"
      }
      output_map {
        key: "output_ids"
        value: "output_ids"
      }
    },
    {
      model_name: "postprocessing"
      model_version: -1
      input_map {
        key: "output_ids"
        value: "output_ids"
      }
      output_map {
        key: "text_output"
        value: "text_output"
      }
    }
  ]
}
